; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=210, out_folder=./training, instance_id=9, seed=2033, goal_proportion=0.03

(define (problem blocksworld-09)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 - object)
 (:init 
    (arm-empty)
    (clear b118)
    (on b118 b124)
    (on b124 b177)
    (on b177 b45)
    (on b45 b156)
    (on b156 b191)
    (on-table b191)
    (clear b165)
    (on b165 b39)
    (on-table b39)
    (clear b192)
    (on b192 b87)
    (on b87 b134)
    (on b134 b107)
    (on b107 b113)
    (on b113 b167)
    (on-table b167)
    (clear b198)
    (on b198 b90)
    (on b90 b147)
    (on b147 b43)
    (on-table b43)
    (clear b152)
    (on b152 b163)
    (on b163 b89)
    (on b89 b206)
    (on b206 b7)
    (on b7 b23)
    (on-table b23)
    (clear b136)
    (on b136 b38)
    (on b38 b78)
    (on-table b78)
    (clear b91)
    (on b91 b21)
    (on-table b21)
    (clear b4)
    (on b4 b128)
    (on b128 b139)
    (on b139 b197)
    (on b197 b161)
    (on b161 b158)
    (on b158 b169)
    (on b169 b203)
    (on b203 b15)
    (on b15 b130)
    (on-table b130)
    (clear b62)
    (on b62 b120)
    (on-table b120)
    (clear b138)
    (on b138 b71)
    (on-table b71)
    (clear b80)
    (on b80 b133)
    (on b133 b199)
    (on b199 b58)
    (on b58 b150)
    (on-table b150)
    (clear b157)
    (on b157 b155)
    (on b155 b19)
    (on b19 b141)
    (on-table b141)
    (clear b137)
    (on b137 b8)
    (on-table b8)
    (clear b135)
    (on-table b135)
    (clear b69)
    (on b69 b145)
    (on-table b145)
    (clear b171)
    (on-table b171)
    (clear b53)
    (on b53 b129)
    (on-table b129)
    (clear b148)
    (on b148 b200)
    (on-table b200)
    (clear b168)
    (on b168 b24)
    (on b24 b44)
    (on b44 b22)
    (on-table b22)
    (clear b88)
    (on b88 b188)
    (on b188 b104)
    (on b104 b105)
    (on b105 b116)
    (on-table b116)
    (clear b149)
    (on b149 b180)
    (on b180 b37)
    (on b37 b126)
    (on-table b126)
    (clear b173)
    (on b173 b92)
    (on b92 b63)
    (on b63 b12)
    (on-table b12)
    (clear b205)
    (on-table b205)
    (clear b36)
    (on-table b36)
    (clear b110)
    (on b110 b72)
    (on b72 b154)
    (on-table b154)
    (clear b122)
    (on-table b122)
    (clear b68)
    (on b68 b60)
    (on b60 b166)
    (on b166 b95)
    (on-table b95)
    (clear b18)
    (on b18 b187)
    (on b187 b31)
    (on b31 b172)
    (on b172 b65)
    (on b65 b77)
    (on b77 b70)
    (on b70 b20)
    (on-table b20)
    (clear b6)
    (on-table b6)
    (clear b181)
    (on b181 b114)
    (on b114 b153)
    (on b153 b2)
    (on-table b2)
    (clear b186)
    (on-table b186)
    (clear b85)
    (on b85 b109)
    (on b109 b208)
    (on b208 b35)
    (on b35 b14)
    (on-table b14)
    (clear b73)
    (on-table b73)
    (clear b67)
    (on b67 b111)
    (on b111 b194)
    (on b194 b175)
    (on b175 b108)
    (on b108 b160)
    (on-table b160)
    (clear b142)
    (on b142 b176)
    (on-table b176)
    (clear b17)
    (on b17 b202)
    (on b202 b59)
    (on b59 b54)
    (on b54 b159)
    (on-table b159)
    (clear b50)
    (on b50 b209)
    (on b209 b52)
    (on b52 b51)
    (on-table b51)
    (clear b56)
    (on b56 b83)
    (on b83 b98)
    (on-table b98)
    (clear b112)
    (on-table b112)
    (clear b103)
    (on b103 b48)
    (on b48 b5)
    (on b5 b170)
    (on b170 b189)
    (on b189 b55)
    (on b55 b119)
    (on b119 b74)
    (on b74 b185)
    (on b185 b30)
    (on-table b30)
    (clear b13)
    (on-table b13)
    (clear b117)
    (on b117 b9)
    (on b9 b11)
    (on b11 b131)
    (on b131 b183)
    (on b183 b121)
    (on b121 b3)
    (on b3 b79)
    (on b79 b75)
    (on-table b75)
    (clear b46)
    (on b46 b41)
    (on b41 b125)
    (on b125 b86)
    (on b86 b179)
    (on b179 b162)
    (on-table b162)
    (clear b84)
    (on b84 b201)
    (on b201 b26)
    (on b26 b42)
    (on b42 b132)
    (on b132 b76)
    (on-table b76)
    (clear b196)
    (on b196 b182)
    (on b182 b178)
    (on b178 b207)
    (on b207 b66)
    (on b66 b195)
    (on b195 b10)
    (on b10 b96)
    (on b96 b47)
    (on b47 b25)
    (on-table b25)
    (clear b29)
    (on b29 b82)
    (on b82 b193)
    (on b193 b40)
    (on b40 b1)
    (on b1 b93)
    (on b93 b102)
    (on b102 b97)
    (on b97 b127)
    (on b127 b57)
    (on-table b57)
    (clear b16)
    (on b16 b174)
    (on b174 b164)
    (on b164 b28)
    (on-table b28)
    (clear b81)
    (on-table b81)
    (clear b115)
    (on b115 b64)
    (on-table b64)
    (clear b123)
    (on b123 b33)
    (on b33 b151)
    (on-table b151)
    (clear b32)
    (on b32 b140)
    (on b140 b143)
    (on b143 b99)
    (on b99 b61)
    (on b61 b100)
    (on-table b100)
    (clear b204)
    (on b204 b94)
    (on b94 b190)
    (on b190 b210)
    (on b210 b49)
    (on b49 b184)
    (on b184 b144)
    (on-table b144)
    (clear b146)
    (on b146 b101)
    (on b101 b27)
    (on b27 b34)
    (on-table b34)
    (clear b106)
    (on-table b106))
 (:goal  (and 
    (clear b3)
    (on b3 b6)
    (on b6 b2)
    (on b2 b4)
    (on b4 b1)
    (on b1 b5)
    (on-table b5))))

; plan
1. (unstack b103 b48)
   deleted: (on b103 b48) (clear b103) (arm-empty)
   added: (holding b103) (clear b48)
   goals met: 0 of 7
2. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 0 of 7
3. (unstack b117 b9)
   deleted: (on b117 b9) (clear b117) (arm-empty)
   added: (holding b117) (clear b9)
   goals met: 0 of 7
4. (putdown b117)
   deleted: (holding b117)
   added: (clear b117) (arm-empty) (on-table b117)
   goals met: 0 of 7
5. (unstack b181 b114)
   deleted: (on b181 b114) (clear b181) (arm-empty)
   added: (holding b181) (clear b114)
   goals met: 0 of 7
6. (putdown b181)
   deleted: (holding b181)
   added: (clear b181) (arm-empty) (on-table b181)
   goals met: 0 of 7
7. (unstack b114 b153)
   deleted: (on b114 b153) (clear b114) (arm-empty)
   added: (holding b114) (clear b153)
   goals met: 0 of 7
8. (putdown b114)
   deleted: (holding b114)
   added: (clear b114) (arm-empty) (on-table b114)
   goals met: 0 of 7
9. (unstack b153 b2)
   deleted: (on b153 b2) (clear b153) (arm-empty)
   added: (holding b153) (clear b2)
   goals met: 0 of 7
10. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 0 of 7
11. (unstack b29 b82)
   deleted: (on b29 b82) (clear b29) (arm-empty)
   added: (holding b29) (clear b82)
   goals met: 0 of 7
12. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 0 of 7
13. (unstack b48 b5)
   deleted: (on b48 b5) (clear b48) (arm-empty)
   added: (holding b48) (clear b5)
   goals met: 0 of 7
14. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 0 of 7
15. (unstack b5 b170)
   deleted: (on b5 b170) (clear b5) (arm-empty)
   added: (holding b5) (clear b170)
   goals met: 0 of 7
16. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 7
17. (unstack b82 b193)
   deleted: (on b82 b193) (clear b82) (arm-empty)
   added: (holding b82) (clear b193)
   goals met: 1 of 7
18. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 1 of 7
19. (unstack b193 b40)
   deleted: (on b193 b40) (clear b193) (arm-empty)
   added: (holding b193) (clear b40)
   goals met: 1 of 7
20. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 1 of 7
21. (unstack b40 b1)
   deleted: (on b40 b1) (clear b40) (arm-empty)
   added: (holding b40) (clear b1)
   goals met: 1 of 7
22. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 1 of 7
23. (unstack b9 b11)
   deleted: (on b9 b11) (clear b9) (arm-empty)
   added: (holding b9) (clear b11)
   goals met: 1 of 7
24. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 7
25. (unstack b11 b131)
   deleted: (on b11 b131) (clear b11) (arm-empty)
   added: (holding b11) (clear b131)
   goals met: 1 of 7
26. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 7
27. (unstack b131 b183)
   deleted: (on b131 b183) (clear b131) (arm-empty)
   added: (holding b131) (clear b183)
   goals met: 1 of 7
28. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 1 of 7
29. (unstack b183 b121)
   deleted: (on b183 b121) (clear b183) (arm-empty)
   added: (holding b183) (clear b121)
   goals met: 1 of 7
30. (putdown b183)
   deleted: (holding b183)
   added: (clear b183) (arm-empty) (on-table b183)
   goals met: 1 of 7
31. (unstack b121 b3)
   deleted: (on b121 b3) (clear b121) (arm-empty)
   added: (holding b121) (clear b3)
   goals met: 2 of 7
32. (putdown b121)
   deleted: (holding b121)
   added: (clear b121) (arm-empty) (on-table b121)
   goals met: 2 of 7
33. (unstack b1 b93)
   deleted: (on b1 b93) (clear b1) (arm-empty)
   added: (holding b1) (clear b93)
   goals met: 2 of 7
34. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 3 of 7
35. (unstack b4 b128)
   deleted: (on b4 b128) (clear b4) (arm-empty)
   added: (holding b4) (clear b128)
   goals met: 3 of 7
36. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 4 of 7
37. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 7
38. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 5 of 7
39. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 5 of 7
40. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 6 of 7
41. (unstack b3 b79)
   deleted: (on b3 b79) (clear b3) (arm-empty)
   added: (holding b3) (clear b79)
   goals met: 5 of 7
42. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 7 of 7
